# Класс исключений для строк с неправильным концом/терминатором
class EndError(Exception):
    pass

# Азбука Морзе (ваш кэп)
MorseDict = {
    '.-':   'а', '-...': 'б', '.--':    'в', '--.':  'г', '-..':  'д', '.':       'е',
    '...-': 'ж', '--..': 'з', '..':     'и', '.---': 'й', '-.-':  'к', '.-..':    'л',
    '--':   'м', '-.':   'н', '---':    'о', '.--.': 'п', '.-.':  'р', '...':     'с',
    '-':    'т', '..-':  'у', '..-.':   'ф', '....': 'х', '-.-.': 'ц', '---.':    'ч',
    '----': 'ш', '--.-': 'щ', '.--.-.': 'ъ', '-.--': 'ы', '-..-': 'ь', '...-...': 'э',
    '..--': 'ю', '.-.-': 'я',

    '/': ' '
    }

# Работаем с листом
message = input().split(' ')

# Проверка на правильный конец/терминатор
if (message[-1] != 'End'):
    raise EndError("Error: The \'End\' terminator is absent!")

# Замена всех элементов по словарю
for i in range(len(message) - 1):
    message[i] = MorseDict[message[i]]

# Выводим все элементы, кроме End
print(''.join(message[:-1]))
